### MySQL with python

In [1]:
%pip install python-dotenv sqlalchemy pymysql

Requirement already satisfied: python-dotenv in c:\adv python 8-10pm thu fri\repository\venv\lib\site-packages (1.0.1)
Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.36-cp312-cp312-win_amd64.whl.metadata (9.9 kB)
Collecting pymysql
  Using cached PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\adv python 8-10pm thu fri\repository\venv\lib\site-packages (from sqlalchemy) (4.12.2)
Collecting greenlet!=0.4.17 (from sqlalchemy)
  Downloading greenlet-3.1.1-cp312-cp312-win_amd64.whl.metadata (3.9 kB)
Downloading SQLAlchemy-2.0.36-cp312-cp312-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---------------------------------------- 2.1/2.1 MB 23.4 MB/s eta 0:00:00
Using cached PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Downloading greenlet-3.1.1-cp312-cp312-win_amd64.whl (299 kB)
Installing collected packages: pymysql, greenlet, sqlalchemy
Successfully installed greenlet-3.1.1 pymysql-1.1.1 sqlalchemy-2.0.36
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

### Connecting with MySQL Database

In [2]:
from dotenv import load_dotenv
load_dotenv()

True

In [3]:
import os
password = os.getenv("MYSQL_PASSWORD")

In [5]:
from sqlalchemy import URL
url = URL.create(
    drivername= "mysql+pymysql",
    username="root",
    password= password,
    host = "localhost",
    port = 3306,
    database= "pythonsql"
)
print(url)

mysql+pymysql://root:***@localhost:3306/pythonsql

### Create sql engine

In [6]:
from sqlalchemy import create_engine
engine = create_engine(url)

### Creating a table with ORM

In [7]:
from sqlalchemy.orm import DeclarativeBase
from sqlalchemy import Column, Integer, Float, String, Date

class Base(DeclarativeBase):
    pass

class Student(Base):
    __tablename__ = "students"
    id = Column(Integer, primary_key=True, autoincrement=True)
    name = Column(String(50), nullable=False)
    email = Column(String(100), nullable=False, unique=True)
    marks = Column(Float, nullable=False)
    doj = Column(Date, nullable=False)

In [8]:
Base.metadata.create_all(engine)

### Inserting values in Database by providing raw sql

In [9]:
from sqlalchemy import text
from datetime import date

In [ ]:
def add_student(name: str, email: str, marks:float, doj: date):
    query = text(
        "INSERT INTO students(name, email, marks, doj) "
        "VALUES (:name, :email, :marks, :doj);"
    )
    params = {
        "name": name,
        "email": email,
        "marks": marks,
        "doj": doj
    }

    with engine.connect() as connection:
        connection.execute(query, params)
        connection.commit()

In [11]:
add_student(
    name="Sarthak",
    email="sarthak@test.com",
    marks= 87.3,
    doj = date(2023, 6, 15)
)

In [12]:
add_student(
    name="Raman",
    email="raman@test.com",
    marks=67.5,
    doj = date(2021, 1, 3)
)

In [13]:
add_student(
    name="Aditi",
    email="aditi@test.com",
    marks=89.0,
    doj= date(2024, 3, 5)
)

### Viewing the table from database

In [14]:
def view_students_raw():
    query = text("SELECT * FROM students;")
    with engine.connect() as connection:
        results = connection.execute(query)
        for row in results:
            print(row)

In [15]:
view_students_raw()

(1, 'Sarthak', 'sarthak@test.com', 87.3, datetime.date(2023, 6, 15))
(2, 'Raman', 'raman@test.com', 67.5, datetime.date(2021, 1, 3))
(3, 'Aditi', 'aditi@test.com', 89.0, datetime.date(2024, 3, 5))

In [16]:
import pandas as pd

In [19]:
def view_students_df():
    query = text("SELECT * FROM students;")
    with engine.connect() as connection:
        df = pd.read_sql(query, connection)
    return df

In [21]:
s = view_students_df()

In [22]:
s

   id     name             email  marks         doj
0   1  Sarthak  sarthak@test.com   87.3  2023-06-15
1   2    Raman    raman@test.com   67.5  2021-01-03
2   3    Aditi    aditi@test.com   89.0  2024-03-05

### Updating a specific value

In [25]:
def update_email(id: int, updated_email: str):
    query = text(
        "UPDATE students "
        "SET email = :updated_email "
        "WHERE id = :id; "
    )
    params = {
        "updated_email": updated_email,
        "id": id
    }

    with engine.connect() as connection:
        connection.execute(query, params)
        connection.commit()

In [26]:
update_email(id=3, updated_email="aditi4@gmail.com")

In [27]:
view_students_df()

   id     name             email  marks         doj
0   1  Sarthak  sarthak@test.com   87.3  2023-06-15
1   2    Raman    raman@test.com   67.5  2021-01-03
2   3    Aditi  aditi4@gmail.com   89.0  2024-03-05

In [28]:
update_email(id=1, updated_email="sarthaks3@rediffmail.com")

In [29]:
view_students_df()

   id     name                     email  marks         doj
0   1  Sarthak  sarthaks3@rediffmail.com   87.3  2023-06-15
1   2    Raman            raman@test.com   67.5  2021-01-03
2   3    Aditi          aditi4@gmail.com   89.0  2024-03-05

In [30]:
def remove_student(id: int):
    query = text(
        "DELETE FROM students "
        "WHERE id = :id"
    )
    params = {"id": id}

    with engine.connect() as connection:
        connection.execute(query, params)
        connection.commit()

In [31]:
remove_student(id=2)

In [32]:
view_students_df()

   id     name                     email  marks         doj
0   1  Sarthak  sarthaks3@rediffmail.com   87.3  2023-06-15
1   3    Aditi          aditi4@gmail.com   89.0  2024-03-05

### Using ORM instead of raw sql queries here

In [33]:
from sqlalchemy.orm import Session

In [34]:
with Session(engine) as session:
    s1 = Student(
        name="Priya",
        email= "priya@test.com",
        marks= 73.1,
        doj = date(2022, 4, 3)
    )
    s2 = Student(
        name="Suresh",
        email = "surest@test.com",
        marks= 77.0,
        doj = date(2021, 7, 13)
    )
    session.add(s1)
    session.add(s2)
    session.commit()

In [35]:
view_students_df()

   id     name                     email  marks         doj
0   1  Sarthak  sarthaks3@rediffmail.com   87.3  2023-06-15
1   3    Aditi          aditi4@gmail.com   89.0  2024-03-05
2   4    Priya            priya@test.com   73.1  2022-04-03
3   5   Suresh           surest@test.com   77.0  2021-07-13

In [40]:
from sqlalchemy.orm import sessionmaker
Session = sessionmaker(bind=engine)

session = Session()

results = session.query(Student).all()

for row in results:
    print(row.id, row.name, row.email, row.doj)

session.close()

1 Sarthak sarthaks3@rediffmail.com 2023-06-15
3 Aditi aditi4@gmail.com 2024-03-05
4 Priya priya@test.com 2022-04-03
5 Suresh surest@test.com 2021-07-13

In [42]:
view_students_df()

   id     name                     email  marks         doj
0   1  Sarthak  sarthaks3@rediffmail.com   87.3  2023-06-15
1   3    Aditi          aditi4@gmail.com   89.0  2024-03-05
2   4    Priya            priya@test.com   73.1  2022-04-03
3   5   Suresh           surest@test.com   77.0  2021-07-13

In [43]:
add_student(
    name="Rahul",
    email="rahulr@gmail.com",
    marks= 60.0,
    doj= date(2024, 1, 5)
)

In [44]:
view_students_df()

   id     name                     email  marks         doj
0   1  Sarthak  sarthaks3@rediffmail.com   87.3  2023-06-15
1   3    Aditi          aditi4@gmail.com   89.0  2024-03-05
2   4    Priya            priya@test.com   73.1  2022-04-03
3   5   Suresh           surest@test.com   77.0  2021-07-13
4   6    Rahul          rahulr@gmail.com   60.0  2024-01-05

In [47]:
def marks_greater_than(marks: float):
    query = text(
        "SELECT * FROM students "
        "WHERE marks > :marks;"
    )
    params = {"marks": marks}

    with engine.connect() as connection:
        df = pd.read_sql(query, connection, params=params)
    return df

In [48]:
marks_greater_than(marks= 80)

   id     name                     email  marks         doj
0   1  Sarthak  sarthaks3@rediffmail.com   87.3  2023-06-15
1   3    Aditi          aditi4@gmail.com   89.0  2024-03-05

In [50]:
marks_greater_than(70)

   id     name                     email  marks         doj
0   1  Sarthak  sarthaks3@rediffmail.com   87.3  2023-06-15
1   3    Aditi          aditi4@gmail.com   89.0  2024-03-05
2   4    Priya            priya@test.com   73.1  2022-04-03
3   5   Suresh           surest@test.com   77.0  2021-07-13

In [51]:
marks_greater_than(88)

   id   name             email  marks         doj
0   3  Aditi  aditi4@gmail.com   89.0  2024-03-05